20250701T213624--kdoc-415-ioreaderのシグネチャはヒープエスケープを避けられる設計になっている__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-27T23:11:54Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 415: io.Readerのシグネチャはヒープエスケープを避けられる設計になっている</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 415: io.Readerのシグネチャはヒープエスケープを避けられる設計になっている</h1>
<div id="outline-container-org75ce678" class="outline-2">
<h2 id="org75ce678"><a href="#org75ce678">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org75ce678">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-07-01 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-07-19 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgce30df1" class="outline-2">
<h2 id="orgce30df1"><a href="#orgce30df1">概要</a></h2>
<div class="outline-text-2" id="text-orgce30df1">
<p>
io.Reader, io.Writerのインターフェース設計には、ヒープのエスケープも関係しているという。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>io.Readerのシグネチャ</label><pre class="src src-go">type Reader interface {
        Read(p []byte) (n int, err error)
}
</pre>
</div>

<p>
<code>[]byte</code> の初期化は呼び出し側の責務になっている。これによって呼び出し側がメモリ管理できるようになる。呼び出し側のスタックに留まり、ヒープにエスケープするのを抑えられる。Readを何度呼んでも新しいヒープ確保が発生しない。呼び出し側がヒープにする自由度もある。
</p>

<p>
実際に試してみる。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>Read1だけがヒープのエスケープが発生する</label><pre class="src src-shell"><span class="org-variable-name">tmpfile</span>=$(mktemp /tmp/tmpgo.XXXXXX.go)

cat &gt; $<span class="org-variable-name">tmpfile</span> &lt;&lt;EOF<span class="org-sh-heredoc">
package main

func main() {}

// Read&#20596;&#12391;&#21021;&#26399;&#21270;&#12375;&#12390;&#36820;&#12377;&#12392;&#12289;&#12498;&#12540;&#12503;&#12395;&#12456;&#12473;&#12465;&#12540;&#12503;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;
func Read1() []byte {
  return make([]byte, 1)
}

// &#21628;&#12403;&#20986;&#12375;&#20596;&#12391;&#21021;&#26399;&#21270;&#12375;&#12390;&#12418;&#12425;&#12358;&#12424;&#12358;&#12395;&#12377;&#12427;&#12392;&#12289;&#12498;&#12540;&#12503;&#12395;&#12456;&#12473;&#12465;&#12540;&#12503;&#12377;&#12427;&#24517;&#35201;&#12364;&#12394;&#12356;
func Read2([]byte) {}

EOF
</span>
go build -gcflags=<span class="org-string">"-m"</span> -o bin $<span class="org-variable-name">tmpfile</span> 2&gt;&amp;1
rm bin
rm $<span class="org-variable-name">tmpfile</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">/tmp/tmpgo.s6wAwW.go:3:6: can inline main
/tmp/tmpgo.s6wAwW.go:6:6: can inline Read1
/tmp/tmpgo.s6wAwW.go:11:6: can inline Read2
/tmp/tmpgo.s6wAwW.go:7:14: make([]byte, 1) escapes to heap
</pre>
</div>
</div>
</div>
<div id="outline-container-org2de3ccf" class="outline-2">
<h2 id="org2de3ccf"><a href="#org2de3ccf">関連</a></h2>
<div class="outline-text-2" id="text-org2de3ccf">
<ul class="org-ul">
<li><a href="https://syntactic-sugar.dev/blog/nested-route/go-escape-analysis">Stack or Heap? Going Deeper with Escape Analysis in Go for Better Performance</a>。調べている中でio.Readerとio.Writerインターフェースの設計について言及していたのを見つけた</li>
<li><a href="20250701T193212--kdoc-414-インターフェースがヒープにエスケープされるのを見る__wiki.html#ID-20250701T193212">KDOC 414: インターフェースがヒープにエスケープされるのを見る</a>。調べるきっかけになった</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
